package ru.levelup.lesson08.employeegenerator;

import ru.levelup.lesson08.employees.Employee;

import java.util.Arrays;
import java.util.Random;

public class FemaleEmployeeFactory extends AbstractEmployeeFactory {
    public FemaleEmployeeFactory(Random randomizer) {
        super(randomizer
                , Arrays.asList("Иванова", "Тимофеева", "Давыдова", "Титова", "Григорьева", "Маркова", "Щербакова", "Шульца"
                        , "Васильева", "Орлова", "Гусева", "Львова", "Степанова", "Новикова", "Полякова", "Миронова"
                        , "Петрова", "Афанасьева", "Данилова", "Фролова", "Семёнова", "Морозова", "Савельева", "Фомина"
                        , "Смирнова", "Филиппова", "Киселёва", "Игнатьева", "Павлова", "Романова", "Шмидта", "Власова"
                        , "Михайлова", "Сергеева", "Сорокина", "Комарова", "Богданова", "Осипова", "Трофимова", "Троицкая"
                        , "Фёдорова", "Захарова", "Тихомирова", "Прокофьева", "Николаева", "Макарова", "Чистякова", "Федотова"
                        , "Соколова", "Матвеева", "Крылова", "Быкова", "Дмитриева", "Зайцева", "Баранова", "Назарова"
                        , "Яковлева", "Виноградова", "Никифорова", "Абрамова", "Егорова", "Беляева", "Сидорова", "Ушакова"
                        , "Попова", "Кузьмина", "Кондратьева", "Голубева", "Волкова", "Гаврилова", "Соболева", "Денисова"
                        , "Андреева", "Максимова", "Кудрявцева", "Пономарёва", "Кузнецова", "Антонова", "Карпова", "Константинова"
                        , "Алексеева", "Козлова", "Борисова", "Покровскийа", "Никитина", "Ефимова", "Белова", "Воронина"
                        , "Александрова", "Ильина", "Жукова", "Мартынова", "Соловьёва", "Леонтьева", "Миллера", "Наумова"
                        , "Лебедева", "Герасимова", "Воробьёва", "Кириллова")
                , Arrays.asList(
                        "Августина", "Аграфена", "Агриппина", "Адель", "Айна", "Ангина", "Анфиса", "Буна", "Владислава", "Габриэлла", "Гелла", "Доминика"
                        , "Дора", "Ждана", "Ивана", "Идея", "Иза", "Изольда", "Илона", "Ирма", "Клементина", "Лара-Алиша", "Лехта", "Лусине", "Мамлакет", "Миляуша"
                        , "Мина", "Мирослава", "Нигина", "Паола", "Савелия", "Тамила", "Фейга", "Флюра", "Фрида", "Хадижат", "Цецилия", "Шахиризада", "Эвелика"
                        , "Эдда", "Эльза", "Эра", "Эрмина")
                , Arrays.asList(
                        "Акиндиновна", "Альфредовна", "Ваделиновна", "Владиковна", "Гениевна", "Евлампиевна", "Иульевна", "Капитоновна", "Маннуиловна", "Мотиевна"
                        , "Никандровна", "Николасовна", "Ошеровна", "Папуновна", "Торгомовна", "Фоминична", "Юнеровна")
                , Employee.Gender.Famale);
    }
}


