package ru.levelup.lesson09.abonentgenerators;

import ru.levelup.lesson09.abonentclasses.Abonent;

import java.util.Arrays;
import java.util.Collection;
import java.util.Random;

public class MaleAbonentFactory<T extends Collection<Abonent>> extends AbstractAbonentFactory<T> {
    public MaleAbonentFactory(Random randomizer, T contactsPattern) {
        super(randomizer
                , Arrays.asList("Иванов", "Тимофеев", "Давыдов", "Титов", "Григорьев", "Марков", "Щербаков", "Шульц"
                        , "Васильев", "Орлов", "Гусев", "Львов", "Степанов", "Новиков", "Поляков", "Миронов"
                        , "Петров", "Афанасьев", "Данилов", "Фролов", "Семёнов", "Морозов", "Савельев", "Фомин"
                        , "Смирнов", "Филиппов", "Киселёв", "Игнатьев", "Павлов", "Романов", "Шмидт", "Власов"
                        , "Михайлов", "Сергеев", "Сорокин", "Комаров", "Богданов", "Осипов", "Трофимов", "Троицкий"
                        , "Фёдоров", "Захаров", "Тихомиров", "Прокофьев", "Николаев", "Макаров", "Чистяков", "Федотов"
                        , "Соколов", "Матвеев", "Крылов", "Быков", "Дмитриев", "Зайцев", "Баранов", "Назаров"
                        , "Яковлев", "Виноградов", "Никифоров", "Абрамов", "Егоров", "Беляев", "Сидоров", "Ушаков"
                        , "Попов", "Кузьмин", "Кондратьев", "Голубев", "Волков", "Гаврилов", "Соболев", "Денисов"
                        , "Андреев", "Максимов", "Кудрявцев", "Пономарёв", "Кузнецов", "Антонов", "Карпов", "Константинов"
                        , "Алексеев", "Козлов", "Борисов", "Покровский", "Никитин", "Ефимов", "Белов", "Воронин"
                        , "Александров", "Ильин", "Жуков", "Мартынов", "Соловьёв", "Леонтьев", "Миллер", "Наумов"
                        , "Лебедев", "Герасимов", "Воробьёв", "Кириллов")
                , Arrays.asList("Ануфрий", "Батуй", "Баженый", "Заброд", "Бархат", "Игор", "Басый", "Фрол"
                        , "Арап", "Всеволод", "Базан", "Забуд", "Бас", "Игорь", "Басырга", "Яхонт"
                        , "Бабак", "Гемир", "Бакан", "Заварза", "Басан", "Казарин", "Батан"
                        , "Бабур", "Глеб", "Бакула", "Завьял", "Басман", "Калган"
                        , "Бажай", "Давыд", "Бакуня", "Захар", "Бастрога", "Лев"
                        , "Бажан", "Ермак", "Бараш", "Иван", "Бастырга", "Осип"
                        , "Бажен", "Жадан", "Баркан", "Ивантей", "Басун", "Руслан")
                , Arrays.asList("Агапович", "Альгердасович", "Евтеевич", "Еремеевич", "Ксенофонтьевич", "Лутфиллоевич", "Маврикович"
                        , "Нисонович", "Октавианович", "Рамонович", "Саввович", "Силыч", "Талантович", "Федосьевич", "Филаретович", "Францевич")
                , contactsPattern
        );
    }
}
